###############################################################
#  Generated by:      Cadence Innovus 21.38-e095_1
#  OS:                Linux x86_64(Host ID rno2-sim-i04-038)
#  Generated on:      Tue Jul 29 17:00:18 2025
#  Design:            pci_bridge32
###############################################################
current_design pci_bridge32
create_clock [get_ports {pci_clk_i}]  -name clk -period 200.000000 -waveform {0.000000 100.000000}
set_input_delay 0.0 [get_ports {pci_clk_i}] -clock clk
set_propagated_clock  [get_clocks {clk}]
set_input_transition -min 2  [get_ports {wb_rst_i}]
set_input_transition -max 10  [get_ports {wb_rst_i}]
set_input_transition -min 2  [get_ports {wb_int_i}]
set_input_transition -max 10  [get_ports {wb_int_i}]
set_input_transition -min 2  [get_ports {wbs_adr_i[31]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[31]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[30]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[30]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[29]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[29]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[28]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[28]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[27]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[27]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[26]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[26]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[25]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[25]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[24]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[24]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[23]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[23]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[22]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[22]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[21]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[21]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[20]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[20]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[19]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[19]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[18]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[18]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[17]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[17]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[16]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[16]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[15]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[15]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[14]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[14]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[13]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[13]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[12]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[12]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[11]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[11]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[10]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[10]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[9]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[9]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[8]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[8]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[7]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[7]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[6]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[6]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[5]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[5]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[4]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[4]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[3]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[3]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[2]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[2]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[1]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[1]}]
set_input_transition -min 2  [get_ports {wbs_adr_i[0]}]
set_input_transition -max 10  [get_ports {wbs_adr_i[0]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[31]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[31]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[30]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[30]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[29]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[29]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[28]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[28]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[27]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[27]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[26]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[26]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[25]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[25]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[24]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[24]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[23]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[23]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[22]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[22]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[21]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[21]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[20]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[20]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[19]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[19]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[18]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[18]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[17]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[17]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[16]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[16]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[15]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[15]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[14]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[14]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[13]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[13]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[12]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[12]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[11]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[11]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[10]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[10]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[9]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[9]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[8]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[8]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[7]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[7]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[6]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[6]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[5]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[5]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[4]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[4]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[3]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[3]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[2]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[2]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[1]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[1]}]
set_input_transition -min 2  [get_ports {wbs_dat_i[0]}]
set_input_transition -max 10  [get_ports {wbs_dat_i[0]}]
set_input_transition -min 2  [get_ports {wbs_sel_i[3]}]
set_input_transition -max 10  [get_ports {wbs_sel_i[3]}]
set_input_transition -min 2  [get_ports {wbs_sel_i[2]}]
set_input_transition -max 10  [get_ports {wbs_sel_i[2]}]
set_input_transition -min 2  [get_ports {wbs_sel_i[1]}]
set_input_transition -max 10  [get_ports {wbs_sel_i[1]}]
set_input_transition -min 2  [get_ports {wbs_sel_i[0]}]
set_input_transition -max 10  [get_ports {wbs_sel_i[0]}]
set_input_transition -min 2  [get_ports {wbs_cyc_i}]
set_input_transition -max 10  [get_ports {wbs_cyc_i}]
set_input_transition -min 2  [get_ports {wbs_stb_i}]
set_input_transition -max 10  [get_ports {wbs_stb_i}]
set_input_transition -min 2  [get_ports {wbs_we_i}]
set_input_transition -max 10  [get_ports {wbs_we_i}]
set_input_transition -min 2  [get_ports {wbs_cti_i[2]}]
set_input_transition -max 10  [get_ports {wbs_cti_i[2]}]
set_input_transition -min 2  [get_ports {wbs_cti_i[1]}]
set_input_transition -max 10  [get_ports {wbs_cti_i[1]}]
set_input_transition -min 2  [get_ports {wbs_cti_i[0]}]
set_input_transition -max 10  [get_ports {wbs_cti_i[0]}]
set_input_transition -min 2  [get_ports {wbs_bte_i[1]}]
set_input_transition -max 10  [get_ports {wbs_bte_i[1]}]
set_input_transition -min 2  [get_ports {wbs_bte_i[0]}]
set_input_transition -max 10  [get_ports {wbs_bte_i[0]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[31]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[31]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[30]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[30]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[29]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[29]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[28]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[28]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[27]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[27]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[26]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[26]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[25]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[25]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[24]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[24]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[23]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[23]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[22]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[22]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[21]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[21]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[20]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[20]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[19]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[19]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[18]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[18]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[17]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[17]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[16]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[16]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[15]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[15]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[14]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[14]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[13]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[13]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[12]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[12]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[11]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[11]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[10]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[10]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[9]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[9]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[8]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[8]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[7]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[7]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[6]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[6]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[5]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[5]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[4]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[4]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[3]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[3]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[2]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[2]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[1]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[1]}]
set_input_transition -min 2  [get_ports {wbm_dat_i[0]}]
set_input_transition -max 10  [get_ports {wbm_dat_i[0]}]
set_input_transition -min 2  [get_ports {wbm_ack_i}]
set_input_transition -max 10  [get_ports {wbm_ack_i}]
set_input_transition -min 2  [get_ports {wbm_rty_i}]
set_input_transition -max 10  [get_ports {wbm_rty_i}]
set_input_transition -min 2  [get_ports {wbm_err_i}]
set_input_transition -max 10  [get_ports {wbm_err_i}]
set_input_transition -min 2  [get_ports {pci_clk_i}]
set_input_transition -max 10  [get_ports {pci_clk_i}]
set_input_transition -min 2  [get_ports {pci_rst_i}]
set_input_transition -max 10  [get_ports {pci_rst_i}]
set_input_transition -min 2  [get_ports {pci_inta_i}]
set_input_transition -max 10  [get_ports {pci_inta_i}]
set_input_transition -min 2  [get_ports {pci_gnt_i}]
set_input_transition -max 10  [get_ports {pci_gnt_i}]
set_input_transition -min 2  [get_ports {pci_frame_i}]
set_input_transition -max 10  [get_ports {pci_frame_i}]
set_input_transition -min 2  [get_ports {pci_irdy_i}]
set_input_transition -max 10  [get_ports {pci_irdy_i}]
set_input_transition -min 2  [get_ports {pci_idsel_i}]
set_input_transition -max 10  [get_ports {pci_idsel_i}]
set_input_transition -min 2  [get_ports {pci_devsel_i}]
set_input_transition -max 10  [get_ports {pci_devsel_i}]
set_input_transition -min 2  [get_ports {pci_trdy_i}]
set_input_transition -max 10  [get_ports {pci_trdy_i}]
set_input_transition -min 2  [get_ports {pci_stop_i}]
set_input_transition -max 10  [get_ports {pci_stop_i}]
set_input_transition -min 2  [get_ports {pci_ad_i[31]}]
set_input_transition -max 10  [get_ports {pci_ad_i[31]}]
set_input_transition -min 2  [get_ports {pci_ad_i[30]}]
set_input_transition -max 10  [get_ports {pci_ad_i[30]}]
set_input_transition -min 2  [get_ports {pci_ad_i[29]}]
set_input_transition -max 10  [get_ports {pci_ad_i[29]}]
set_input_transition -min 2  [get_ports {pci_ad_i[28]}]
set_input_transition -max 10  [get_ports {pci_ad_i[28]}]
set_input_transition -min 2  [get_ports {pci_ad_i[27]}]
set_input_transition -max 10  [get_ports {pci_ad_i[27]}]
set_input_transition -min 2  [get_ports {pci_ad_i[26]}]
set_input_transition -max 10  [get_ports {pci_ad_i[26]}]
set_input_transition -min 2  [get_ports {pci_ad_i[25]}]
set_input_transition -max 10  [get_ports {pci_ad_i[25]}]
set_input_transition -min 2  [get_ports {pci_ad_i[24]}]
set_input_transition -max 10  [get_ports {pci_ad_i[24]}]
set_input_transition -min 2  [get_ports {pci_ad_i[23]}]
set_input_transition -max 10  [get_ports {pci_ad_i[23]}]
set_input_transition -min 2  [get_ports {pci_ad_i[22]}]
set_input_transition -max 10  [get_ports {pci_ad_i[22]}]
set_input_transition -min 2  [get_ports {pci_ad_i[21]}]
set_input_transition -max 10  [get_ports {pci_ad_i[21]}]
set_input_transition -min 2  [get_ports {pci_ad_i[20]}]
set_input_transition -max 10  [get_ports {pci_ad_i[20]}]
set_input_transition -min 2  [get_ports {pci_ad_i[19]}]
set_input_transition -max 10  [get_ports {pci_ad_i[19]}]
set_input_transition -min 2  [get_ports {pci_ad_i[18]}]
set_input_transition -max 10  [get_ports {pci_ad_i[18]}]
set_input_transition -min 2  [get_ports {pci_ad_i[17]}]
set_input_transition -max 10  [get_ports {pci_ad_i[17]}]
set_input_transition -min 2  [get_ports {pci_ad_i[16]}]
set_input_transition -max 10  [get_ports {pci_ad_i[16]}]
set_input_transition -min 2  [get_ports {pci_ad_i[15]}]
set_input_transition -max 10  [get_ports {pci_ad_i[15]}]
set_input_transition -min 2  [get_ports {pci_ad_i[14]}]
set_input_transition -max 10  [get_ports {pci_ad_i[14]}]
set_input_transition -min 2  [get_ports {pci_ad_i[13]}]
set_input_transition -max 10  [get_ports {pci_ad_i[13]}]
set_input_transition -min 2  [get_ports {pci_ad_i[12]}]
set_input_transition -max 10  [get_ports {pci_ad_i[12]}]
set_input_transition -min 2  [get_ports {pci_ad_i[11]}]
set_input_transition -max 10  [get_ports {pci_ad_i[11]}]
set_input_transition -min 2  [get_ports {pci_ad_i[10]}]
set_input_transition -max 10  [get_ports {pci_ad_i[10]}]
set_input_transition -min 2  [get_ports {pci_ad_i[9]}]
set_input_transition -max 10  [get_ports {pci_ad_i[9]}]
set_input_transition -min 2  [get_ports {pci_ad_i[8]}]
set_input_transition -max 10  [get_ports {pci_ad_i[8]}]
set_input_transition -min 2  [get_ports {pci_ad_i[7]}]
set_input_transition -max 10  [get_ports {pci_ad_i[7]}]
set_input_transition -min 2  [get_ports {pci_ad_i[6]}]
set_input_transition -max 10  [get_ports {pci_ad_i[6]}]
set_input_transition -min 2  [get_ports {pci_ad_i[5]}]
set_input_transition -max 10  [get_ports {pci_ad_i[5]}]
set_input_transition -min 2  [get_ports {pci_ad_i[4]}]
set_input_transition -max 10  [get_ports {pci_ad_i[4]}]
set_input_transition -min 2  [get_ports {pci_ad_i[3]}]
set_input_transition -max 10  [get_ports {pci_ad_i[3]}]
set_input_transition -min 2  [get_ports {pci_ad_i[2]}]
set_input_transition -max 10  [get_ports {pci_ad_i[2]}]
set_input_transition -min 2  [get_ports {pci_ad_i[1]}]
set_input_transition -max 10  [get_ports {pci_ad_i[1]}]
set_input_transition -min 2  [get_ports {pci_ad_i[0]}]
set_input_transition -max 10  [get_ports {pci_ad_i[0]}]
set_input_transition -min 2  [get_ports {pci_cbe_i[3]}]
set_input_transition -max 10  [get_ports {pci_cbe_i[3]}]
set_input_transition -min 2  [get_ports {pci_cbe_i[2]}]
set_input_transition -max 10  [get_ports {pci_cbe_i[2]}]
set_input_transition -min 2  [get_ports {pci_cbe_i[1]}]
set_input_transition -max 10  [get_ports {pci_cbe_i[1]}]
set_input_transition -min 2  [get_ports {pci_cbe_i[0]}]
set_input_transition -max 10  [get_ports {pci_cbe_i[0]}]
set_input_transition -min 2  [get_ports {pci_par_i}]
set_input_transition -max 10  [get_ports {pci_par_i}]
set_input_transition -min 2  [get_ports {pci_perr_i}]
set_input_transition -max 10  [get_ports {pci_perr_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_cti_i[1]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_cti_i[1]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[29]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[29]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[11]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[11]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[29]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[29]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[7]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[7]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[1]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[1]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[20]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[20]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[13]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[13]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[20]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[20]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[13]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[13]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[27]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[27]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[7]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[7]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[11]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[11]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[28]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[28]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_sel_i[3]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_sel_i[3]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[7]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[7]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_cti_i[2]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_cti_i[2]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[12]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[12]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_irdy_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_irdy_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_i[0]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_i[0]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[8]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[8]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wb_rst_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wb_rst_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[2]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[2]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[21]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[21]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[14]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[14]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[21]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[21]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[14]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[14]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[28]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[28]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_we_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_we_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[8]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[8]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[12]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[12]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[29]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[29]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_inta_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_inta_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[8]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[8]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[20]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[20]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[13]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[13]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_i[1]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_i[1]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[9]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[9]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_devsel_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_devsel_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[3]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[3]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[22]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[22]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[15]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[15]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[22]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[22]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[15]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[15]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[0]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[0]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[29]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[29]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[9]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[9]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[20]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[20]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[13]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[13]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_stb_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_stb_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[0]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[0]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[9]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[9]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[21]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[21]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[14]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[14]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_i[2]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_i[2]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[0]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[0]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[30]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[30]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[23]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[23]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[16]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[16]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[4]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[4]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[30]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[30]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[23]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[23]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[16]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[16]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[1]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[1]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[21]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[21]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[14]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[14]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[1]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[1]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[22]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[22]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[15]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[15]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_i[3]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_i[3]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[1]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[1]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[5]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[5]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[31]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[31]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[24]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[24]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[17]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[17]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[31]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[31]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[24]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[24]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[17]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[17]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[2]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[2]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_err_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_err_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[22]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[22]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[15]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[15]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[2]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[2]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[30]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[30]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[23]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[23]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[16]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[16]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[2]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[2]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[6]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[6]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[25]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[25]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[18]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[18]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[25]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[25]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[18]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[18]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[3]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[3]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_frame_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_frame_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_stop_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_stop_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[30]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[30]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[23]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[23]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[16]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[16]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[3]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[3]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[31]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[31]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[24]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[24]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[17]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[17]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_cyc_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_cyc_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[3]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[3]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[7]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[7]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[26]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[26]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[19]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[19]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[26]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[26]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[19]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[19]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[4]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[4]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[10]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[10]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[10]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[10]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_bte_i[0]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_bte_i[0]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_gnt_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_gnt_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_trdy_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_trdy_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[31]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[31]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[24]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[24]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[17]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[17]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_par_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_par_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[4]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[4]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[25]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[25]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[18]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[18]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_rty_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_rty_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_sel_i[0]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_sel_i[0]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[4]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[4]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[27]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[27]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[8]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[8]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[27]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[27]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[5]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[5]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_rst_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_rst_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[11]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[11]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[11]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[11]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_bte_i[1]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_bte_i[1]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[25]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[25]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[18]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[18]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_ack_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_ack_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_idsel_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_idsel_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[5]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[5]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[26]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[26]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[19]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[19]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_sel_i[1]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_sel_i[1]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[5]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[5]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[28]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[28]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wb_int_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wb_int_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_cti_i[0]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_cti_i[0]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[9]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[9]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[10]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[10]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[28]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[28]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[6]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[6]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[12]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[12]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_i[0]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_i[0]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_perr_i}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_perr_i}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_adr_i[12]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_adr_i[12]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[26]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[26]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[19]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[19]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[6]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[6]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[10]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[10]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_i[27]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_i[27]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_sel_i[2]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_sel_i[2]}]
set_input_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_i[6]}]
set_input_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_i[6]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[4]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[4]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_oe_o[2]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_oe_o[2]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[2]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[2]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_perr_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_perr_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[0]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[0]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[1]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[1]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[29]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[29]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_trdy_oe_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_trdy_oe_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_bte_o[0]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_bte_o[0]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_sel_o[0]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_sel_o[0]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[12]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[12]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_o[0]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_o[0]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[25]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[25]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[18]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[18]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[28]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[28]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[5]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[5]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_oe_o[3]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_oe_o[3]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[3]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[3]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[1]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[1]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[2]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[2]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_bte_o[1]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_bte_o[1]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_sel_o[1]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_sel_o[1]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[20]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[20]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[13]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[13]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_o[1]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_o[1]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[26]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[26]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[19]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[19]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[29]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[29]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_serr_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_serr_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[6]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[6]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[4]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[4]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[2]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[2]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[3]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[3]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_sel_o[2]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_sel_o[2]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[21]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[21]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[14]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[14]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_stop_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_stop_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_o[2]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_o[2]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[27]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[27]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_inta_oe_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_inta_oe_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[7]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[7]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[5]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[5]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[3]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[3]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[4]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[4]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_sel_o[3]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_sel_o[3]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[22]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[22]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[15]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[15]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_o[3]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_o[3]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[28]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[28]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_serr_oe_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_serr_oe_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wb_int_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wb_int_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[8]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[8]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_err_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_err_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[6]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[6]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[5]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[5]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[4]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[4]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_rst_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_rst_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_rty_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_rty_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[30]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[30]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[23]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[23]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[16]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[16]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[10]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[10]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[29]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[29]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[0]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[0]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[9]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[9]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[7]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[7]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_par_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_par_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[6]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[6]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[5]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[5]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[31]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[31]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[24]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[24]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[17]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[17]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[11]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[11]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[1]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[1]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[8]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[8]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[7]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[7]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[6]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[6]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[25]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[25]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[18]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[18]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[12]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[12]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[10]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[10]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[2]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[2]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[9]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[9]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[7]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[7]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[8]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[8]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_stb_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_stb_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[26]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[26]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[19]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[19]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[20]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[20]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[13]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[13]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[11]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[11]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[3]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[3]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[8]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[8]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[9]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[9]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[10]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[10]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[27]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[27]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[21]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[21]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[14]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[14]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[12]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[12]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[4]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[4]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_req_oe_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_req_oe_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[9]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[9]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_stop_oe_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_stop_oe_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[11]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[11]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[28]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[28]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[22]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[22]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[15]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[15]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[20]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[20]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[13]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[13]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[5]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[5]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_irdy_oe_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_irdy_oe_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[12]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[12]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[29]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[29]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[30]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[30]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[23]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[23]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[16]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[16]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[21]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[21]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[14]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[14]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[6]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[6]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[10]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[10]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[20]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[20]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[13]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[13]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_perr_oe_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_perr_oe_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[31]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[31]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[24]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[24]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[17]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[17]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[22]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[22]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[15]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[15]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[7]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[7]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[11]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[11]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[21]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[21]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[14]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[14]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_devsel_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_devsel_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[25]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[25]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[18]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[18]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[30]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[30]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[23]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[23]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[16]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[16]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[8]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[8]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_irdy_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_irdy_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_cyc_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_cyc_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[22]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[22]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[15]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[15]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_we_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_we_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[12]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[12]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_trdy_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_trdy_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wb_rst_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wb_rst_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[26]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[26]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[19]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[19]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[31]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[31]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[24]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[24]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[17]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[17]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[9]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[9]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_inta_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_inta_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[20]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[20]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[13]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[13]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[30]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[30]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[23]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[23]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[16]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[16]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_cti_o[0]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_cti_o[0]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[0]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[0]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[27]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[27]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[25]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[25]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[18]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[18]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[21]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[21]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[14]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[14]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[31]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[31]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[24]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[24]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[17]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[17]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_cti_o[1]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_cti_o[1]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[1]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[1]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[28]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[28]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[26]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[26]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[19]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[19]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_frame_oe_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_frame_oe_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[22]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[22]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[15]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[15]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[25]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[25]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[18]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[18]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_cti_o[2]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_cti_o[2]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_oe_o[0]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_oe_o[0]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_devsel_oe_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_devsel_oe_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[2]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[2]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[0]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[0]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_frame_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_frame_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[29]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[29]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_par_oe_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_par_oe_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[27]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[27]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[10]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[10]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_rst_oe_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_rst_oe_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[30]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[30]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[23]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[23]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[16]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[16]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[26]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[26]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[19]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[19]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[3]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[3]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_cbe_oe_o[1]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_cbe_oe_o[1]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_o[1]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_o[1]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_req_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_req_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[0]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[0]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_dat_o[28]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_dat_o[28]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_dat_o[11]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_dat_o[11]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbs_ack_o}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbs_ack_o}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[31]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[31]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[24]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[24]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[17]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {pci_ad_oe_o[17]}]
set_output_delay -add_delay 10 -min -clock [get_clocks {clk}] [get_ports {wbm_adr_o[27]}]
set_output_delay -add_delay 20 -max -clock [get_clocks {clk}] [get_ports {wbm_adr_o[27]}]
set_clock_latency -35.2  [get_pins {{input_register_pci_ad_reg_out_reg[12]/CLK}}]
set_clock_latency -67.1  [get_pins {input_register_pci_trdy_reg_out_reg/CLK}]
set_clock_latency -59.7  [get_pins {{pci_target_unit_fifos_pcir_fifo_ctrl_rclk_wgrey_addr_reg[2]/CLK}}]
set_clock_latency -26.9  [get_pins {i_pci_wbs_wbb3_2_wbb2_wbs_rty_o_reg/CLK}]
set_clock_latency -29.2  [get_pins {{wishbone_slave_unit_pci_initiator_sm_rdata_selector_reg[0]/CLK}}]
set_clock_latency -39.8  [get_pins {{pci_target_unit_pci_target_if_strd_address_reg[7]/CLK}}]
set_clock_latency -38.4  [get_pins {wishbone_slave_unit_wishbone_slave_del_completion_allow_reg/CLK}]
set_clock_latency -53.6  [get_pins {{wishbone_slave_unit_wishbone_slave_img_hit_reg[1]/CLK}}]
set_clock_latency -30.6  [get_pins {{pci_target_unit_del_sync_bc_out_reg[2]/CLK}}]
set_clock_latency -44.7  [get_pins {{input_register_pci_ad_reg_out_reg[28]/CLK}}]
set_clock_latency -48.4  [get_pins {{wishbone_slave_unit_fifos_outGreyCount_reg[0]/CLK}}]
set_clock_latency -22.2  [get_pins {{wishbone_slave_unit_fifos_wbr_fifo_ctrl_rgrey_addr_reg[1]/CLK}}]
set_clock_latency -22.7  [get_pins {pci_target_unit_pci_target_sm_norm_access_to_conf_reg_reg/CLK}]
set_clock_latency -43.5  [get_pins {{pci_target_unit_wishbone_master_c_state_reg[2]/CLK}}]
set_clock_latency -49.8  [get_pins {{wishbone_slave_unit_fifos_wbr_fifo_ctrl_rclk_wgrey_addr_reg[0]/CLK}}]
set_clock_latency -40.2  [get_pins {{pci_target_unit_pci_target_if_strd_address_reg[2]/CLK}}]
set_clock_latency -68.8  [get_pins {{wishbone_slave_unit_fifos_pci_clk_inGreyCount_reg[1]/CLK}}]
set_clock_latency -48.5  [get_pins {configuration_init_complete_reg/CLK}]
set_clock_latency -47.7  [get_pins {{pci_target_unit_fifos_pciw_fifo_ctrl_wclk_rgrey_minus2_reg[1]/CLK}}]
set_clock_latency -35.8  [get_pins {{input_register_pci_ad_reg_out_reg[16]/CLK}}]
set_clock_latency -45.4  [get_pins {{input_register_pci_ad_reg_out_reg[23]/CLK}}]
set_clock_latency -51.3  [get_pins {{input_register_pci_ad_reg_out_reg[30]/CLK}}]
set_clock_latency -27.2  [get_pins {{pci_target_unit_wishbone_master_rty_counter_reg[3]/CLK}}]
set_clock_latency -60.1  [get_pins {i_pci_wbs_wbb3_2_wbb2_wbs_we_o_reg/CLK}]
set_clock_latency -14.9  [get_pins {{pci_target_unit_fifos_pcir_fifo_ctrl_rgrey_addr_reg[1]/CLK}}]
set_clock_latency -66.9  [get_pins {{wishbone_slave_unit_fifos_wbw_fifo_ctrl_rclk_wgrey_next_reg[3]/CLK}}]
set_clock_latency -38.2  [get_pins {wishbone_slave_unit_pci_initiator_if_del_read_req_reg/CLK}]
set_clock_latency -26.3  [get_pins {{pci_target_unit_fifos_pciw_fifo_ctrl_wgrey_next_reg[0]/CLK}}]
set_clock_latency -23.5  [get_pins {{configuration_pci_am1_reg[31]/CLK}}]
set_clock_latency -59.1  [get_pins {{pci_target_unit_fifos_pcir_fifo_ctrl_rclk_wgrey_addr_reg[1]/CLK}}]
set_clock_latency -32  [get_pins {{pci_target_unit_fifos_pciw_fifo_ctrl_rgrey_addr_reg[2]/CLK}}]
set_clock_latency -50.8  [get_pins {{input_register_pci_ad_reg_out_reg[11]/CLK}}]
set_clock_latency -41.8  [get_pins {{wishbone_slave_unit_fifos_wbw_fifo_ctrl_rgrey_next_reg[3]/CLK}}]
set_clock_latency -39.7  [get_pins {{pci_target_unit_pci_target_if_strd_address_reg[6]/CLK}}]
set_clock_latency -29  [get_pins {{wishbone_slave_unit_pci_initiator_if_bc_out_reg[2]/CLK}}]
set_clock_latency -52.2  [get_pins {{wishbone_slave_unit_wishbone_slave_img_hit_reg[0]/CLK}}]
set_clock_latency -32.5  [get_pins {pci_target_unit_pci_target_sm_rw_cbe0_reg/CLK}]
set_clock_latency -36.3  [get_pins {{pci_target_unit_del_sync_bc_out_reg[1]/CLK}}]
set_clock_latency -46.1  [get_pins {{input_register_pci_ad_reg_out_reg[27]/CLK}}]
set_clock_latency -12.8  [get_pins {{pci_target_unit_wishbone_master_rty_counter_reg[7]/CLK}}]
set_clock_latency -36.8  [get_pins {{wishbone_slave_unit_pci_initiator_sm_cur_state_reg[3]/CLK}}]
set_clock_latency -24.1  [get_pins {{wishbone_slave_unit_fifos_wbr_fifo_ctrl_rgrey_addr_reg[0]/CLK}}]
set_clock_latency -40  [get_pins {{pci_target_unit_wishbone_master_c_state_reg[1]/CLK}}]
set_clock_latency -27.1  [get_pins {{wishbone_slave_unit_wishbone_slave_c_state_reg[2]/CLK}}]
set_clock_latency -49.7  [get_pins {{input_register_pci_cbe_reg_out_reg[3]/CLK}}]
set_clock_latency -38.5  [get_pins {{pci_target_unit_pci_target_if_strd_address_reg[1]/CLK}}]
set_clock_latency -48.8  [get_pins {wishbone_slave_unit_pci_initiator_if_err_recovery_reg/CLK}]
set_clock_latency -65.3  [get_pins {{wishbone_slave_unit_fifos_pci_clk_inGreyCount_reg[0]/CLK}}]
set_clock_latency -57.8  [get_pins {{pci_target_unit_fifos_pciw_fifo_ctrl_wclk_rgrey_minus2_reg[0]/CLK}}]
set_clock_latency -45.1  [get_pins {{input_register_pci_ad_reg_out_reg[15]/CLK}}]
set_clock_latency -57  [get_pins {{input_register_pci_ad_reg_out_reg[22]/CLK}}]
set_clock_latency -28.5  [get_pins {{pci_target_unit_wishbone_master_rty_counter_reg[2]/CLK}}]
set_clock_latency -27.9  [get_pins {wishbone_slave_unit_wishbone_slave_map_reg/CLK}]
set_clock_latency -15.3  [get_pins {{pci_target_unit_fifos_pcir_fifo_ctrl_rgrey_addr_reg[0]/CLK}}]
set_clock_latency -66.7  [get_pins {{wishbone_slave_unit_fifos_wbw_fifo_ctrl_rclk_wgrey_next_reg[2]/CLK}}]
set_clock_latency -50  [get_pins {{pci_target_unit_fifos_pciw_fifo_ctrl_rclk_wgrey_addr_reg[2]/CLK}}]
set_clock_latency -11.5  [get_pins {i_pci_wbs_wbb3_2_wbb2_wbs_cyc_o_reg/CLK}]
set_clock_latency -58.1  [get_pins {wishbone_slave_unit_pci_initiator_if_rdy_out_reg/CLK}]
set_clock_latency -64  [get_pins {{pci_target_unit_fifos_pcir_fifo_ctrl_rclk_wgrey_addr_reg[0]/CLK}}]
set_clock_latency -47.2  [get_pins {{pci_target_unit_fifos_pciw_fifo_ctrl_rgrey_addr_reg[1]/CLK}}]
set_clock_latency -48.8  [get_pins {{wishbone_slave_unit_fifos_wbr_fifo_ctrl_rclk_wgrey_addr_reg[3]/CLK}}]
set_clock_latency -61.5  [get_pins {{input_register_pci_ad_reg_out_reg[10]/CLK}}]
set_clock_latency -49.5  [get_pins {{wishbone_slave_unit_fifos_wbw_fifo_ctrl_rgrey_next_reg[2]/CLK}}]
set_clock_latency -36.5  [get_pins {{pci_target_unit_pci_target_if_strd_address_reg[5]/CLK}}]
set_clock_latency -11.5  [get_pins {i_pci_wbs_wbb3_2_wbb2_wbs_ack_o_reg/CLK}]
set_clock_latency -29.4  [get_pins {{wishbone_slave_unit_pci_initiator_if_bc_out_reg[1]/CLK}}]
set_clock_latency -11.2  [get_pins {output_backup_trdy_en_out_reg/CLK}]
set_clock_latency -30.6  [get_pins {pci_target_unit_del_sync_req_req_pending_reg/CLK}]
set_clock_latency -48.2  [get_pins {{input_register_pci_ad_reg_out_reg[19]/CLK}}]
set_clock_latency -49.9  [get_pins {{input_register_pci_ad_reg_out_reg[26]/CLK}}]
set_clock_latency -20  [get_pins {{pci_target_unit_wishbone_master_rty_counter_reg[6]/CLK}}]
set_clock_latency -39.5  [get_pins {{wishbone_slave_unit_pci_initiator_sm_cur_state_reg[2]/CLK}}]
set_clock_latency -33.9  [get_pins {{pci_target_unit_wishbone_master_c_state_reg[0]/CLK}}]
set_clock_latency -48.9  [get_pins {wishbone_slave_unit_pci_initiator_if_write_req_int_reg/CLK}]
set_clock_latency -39.9  [get_pins {{wishbone_slave_unit_wishbone_slave_c_state_reg[1]/CLK}}]
set_clock_latency -45.8  [get_pins {{input_register_pci_cbe_reg_out_reg[2]/CLK}}]
set_clock_latency -42.3  [get_pins {{pci_target_unit_pci_target_if_strd_address_reg[0]/CLK}}]
set_clock_latency -50.3  [get_pins {{input_register_pci_ad_reg_out_reg[14]/CLK}}]
set_clock_latency -50.6  [get_pins {{input_register_pci_ad_reg_out_reg[21]/CLK}}]
set_clock_latency -36.5  [get_pins {{pci_target_unit_wishbone_master_rty_counter_reg[1]/CLK}}]
set_clock_latency -62.9  [get_pins {wishbone_slave_unit_pci_initiator_if_intermediate_last_reg/CLK}]
set_clock_latency -31  [get_pins {{pci_target_unit_pci_target_if_strd_address_reg[9]/CLK}}]
set_clock_latency -11  [get_pins {{pci_target_unit_pci_target_sm_c_state_reg[0]/CLK}}]
set_clock_latency -65.2  [get_pins {{wishbone_slave_unit_fifos_wbw_fifo_ctrl_rclk_wgrey_next_reg[1]/CLK}}]
set_clock_latency -24.1  [get_pins {i_pci_wbs_wbb3_2_wbb2_wbs_err_o_reg/CLK}]
set_clock_latency -44.6  [get_pins {{wishbone_slave_unit_fifos_outGreyCount_reg[2]/CLK}}]
set_clock_latency -50.9  [get_pins {{pci_target_unit_fifos_pciw_fifo_ctrl_rclk_wgrey_addr_reg[1]/CLK}}]
set_clock_latency -23  [get_pins {{wishbone_slave_unit_fifos_wbr_fifo_ctrl_rgrey_addr_reg[3]/CLK}}]
set_clock_latency -30.8  [get_pins {{pci_target_unit_fifos_pciw_fifo_ctrl_wgrey_addr_reg[1]/CLK}}]
set_clock_latency -10.2  [get_pins {{pci_target_unit_fifos_pciw_fifo_ctrl_rgrey_addr_reg[0]/CLK}}]
set_clock_latency -50.7  [get_pins {{wishbone_slave_unit_fifos_wbr_fifo_ctrl_rclk_wgrey_addr_reg[2]/CLK}}]
set_clock_latency -50.6  [get_pins {{wishbone_slave_unit_fifos_wbw_fifo_ctrl_rgrey_next_reg[1]/CLK}}]
set_clock_latency -31.6  [get_pins {{pci_target_unit_pci_target_if_strd_address_reg[4]/CLK}}]
set_clock_latency -48.2  [get_pins {{input_register_pci_ad_reg_out_reg[9]/CLK}}]
set_clock_latency -48.4  [get_pins {{input_register_pci_ad_reg_out_reg[18]/CLK}}]
set_clock_latency -45.1  [get_pins {{input_register_pci_ad_reg_out_reg[25]/CLK}}]
set_clock_latency -27.2  [get_pins {{pci_target_unit_pci_target_if_norm_bc_reg[3]/CLK}}]
set_clock_latency -11  [get_pins {{pci_target_unit_wishbone_master_rty_counter_reg[5]/CLK}}]
set_clock_latency -43.1  [get_pins {{wishbone_slave_unit_pci_initiator_sm_cur_state_reg[1]/CLK}}]
set_clock_latency -10.3  [get_pins {pci_target_unit_pci_target_sm_same_read_reg_reg/CLK}]
set_clock_latency -26  [get_pins {{wishbone_slave_unit_wishbone_slave_c_state_reg[0]/CLK}}]
set_clock_latency -59.3  [get_pins {{input_register_pci_cbe_reg_out_reg[1]/CLK}}]
set_clock_latency -28.5  [get_pins {output_backup_frame_en_out_reg/CLK}]
set_clock_latency -50.8  [get_pins {input_register_pci_irdy_reg_out_reg/CLK}]
set_clock_latency -53.7  [get_pins {i_pci_wbs_wbb3_2_wbb2_wbs_cab_o_reg/CLK}]
set_clock_latency -50.2  [get_pins {{input_register_pci_ad_reg_out_reg[13]/CLK}}]
set_clock_latency -35.3  [get_pins {{input_register_pci_ad_reg_out_reg[20]/CLK}}]
set_clock_latency -45.4  [get_pins {{pci_target_unit_wishbone_master_rty_counter_reg[0]/CLK}}]
set_clock_latency -46.4  [get_pins {{wishbone_slave_unit_pci_initiator_sm_rdata_selector_reg[1]/CLK}}]
set_clock_latency -40.1  [get_pins {{pci_target_unit_pci_target_if_strd_address_reg[8]/CLK}}]
set_clock_latency -39.3  [get_pins {input_register_pci_devsel_reg_out_reg/CLK}]
set_clock_latency -29.8  [get_pins {pci_target_unit_wishbone_master_w_attempt_reg/CLK}]
set_clock_latency -31  [get_pins {{pci_target_unit_del_sync_bc_out_reg[3]/CLK}}]
set_clock_latency -65.4  [get_pins {{wishbone_slave_unit_fifos_wbw_fifo_ctrl_rclk_wgrey_next_reg[0]/CLK}}]
set_clock_latency -45.9  [get_pins {{input_register_pci_ad_reg_out_reg[29]/CLK}}]
set_clock_latency -51.2  [get_pins {{wishbone_slave_unit_fifos_outGreyCount_reg[1]/CLK}}]
set_clock_latency -45  [get_pins {{pci_target_unit_fifos_pciw_fifo_ctrl_rclk_wgrey_addr_reg[0]/CLK}}]
set_clock_latency -55.7  [get_pins {pci_target_unit_pci_target_sm_cnf_progress_reg/CLK}]
set_clock_latency -23.8  [get_pins {{wishbone_slave_unit_fifos_wbr_fifo_ctrl_rgrey_addr_reg[2]/CLK}}]
set_clock_latency -49.8  [get_pins {{wishbone_slave_unit_fifos_wbr_fifo_ctrl_rclk_wgrey_addr_reg[1]/CLK}}]
set_clock_latency -52.7  [get_pins {{wishbone_slave_unit_fifos_wbw_fifo_ctrl_rgrey_next_reg[0]/CLK}}]
set_clock_latency -34.5  [get_pins {{pci_target_unit_pci_target_if_strd_address_reg[3]/CLK}}]
set_clock_latency -11.1  [get_pins {output_backup_trdy_out_reg/CLK}]
set_clock_latency -65.3  [get_pins {{wishbone_slave_unit_fifos_pci_clk_inGreyCount_reg[2]/CLK}}]
set_clock_latency -14.7  [get_pins {wishbone_slave_unit_wishbone_slave_del_addr_hit_reg/CLK}]
set_clock_latency -44.5  [get_pins {{input_register_pci_ad_reg_out_reg[8]/CLK}}]
set_clock_latency -26  [get_pins {{pci_target_unit_pci_target_if_norm_bc_reg[2]/CLK}}]
set_clock_latency -44.9  [get_pins {input_register_pci_frame_reg_out_reg/CLK}]
set_clock_latency -52  [get_pins {{input_register_pci_ad_reg_out_reg[17]/CLK}}]
set_clock_latency -62.2  [get_pins {{input_register_pci_ad_reg_out_reg[24]/CLK}}]
set_clock_latency -56.9  [get_pins {{input_register_pci_ad_reg_out_reg[31]/CLK}}]
set_clock_latency -21.6  [get_pins {{pci_target_unit_wishbone_master_rty_counter_reg[4]/CLK}}]
set_clock_latency -39.4  [get_pins {{wishbone_slave_unit_pci_initiator_sm_cur_state_reg[0]/CLK}}]
set_clock_latency -39.2  [get_pins {wishbone_slave_unit_pci_initiator_if_posted_write_req_reg/CLK}]
set_clock_latency -15.5  [get_pins {{pci_target_unit_fifos_pcir_fifo_ctrl_rgrey_addr_reg[2]/CLK}}]
set_clock_latency -60.2  [get_pins {{input_register_pci_cbe_reg_out_reg[0]/CLK}}]
set_clock_latency -45.8  [get_pins {pci_target_unit_wishbone_master_addr_into_cnt_reg_reg/CLK}]
