###############################################################
#  Generated by:      Cadence Innovus 21.38-e095_1
#  OS:                Linux x86_64(Host ID rno2-sim-i04-038)
#  Generated on:      Tue Jul 29 17:03:23 2025
#  Design:            des
###############################################################
current_design des
create_clock [get_ports {clk}]  -name clk -period 250.000000 -waveform {0.000000 125.000000}
set_input_delay 0.0 [get_ports {clk}] -clock clk
set_propagated_clock  [get_clocks {clk}]
set_input_transition -min 2.5  [get_ports {clk}]
set_input_transition -max 12.5  [get_ports {clk}]
set_input_transition -min 2.5  [get_ports {reset}]
set_input_transition -max 12.5  [get_ports {reset}]
set_input_transition -min 2.5  [get_ports {load_i}]
set_input_transition -max 12.5  [get_ports {load_i}]
set_input_transition -min 2.5  [get_ports {decrypt_i}]
set_input_transition -max 12.5  [get_ports {decrypt_i}]
set_input_transition -min 2.5  [get_ports {data_i[63]}]
set_input_transition -max 12.5  [get_ports {data_i[63]}]
set_input_transition -min 2.5  [get_ports {data_i[62]}]
set_input_transition -max 12.5  [get_ports {data_i[62]}]
set_input_transition -min 2.5  [get_ports {data_i[61]}]
set_input_transition -max 12.5  [get_ports {data_i[61]}]
set_input_transition -min 2.5  [get_ports {data_i[60]}]
set_input_transition -max 12.5  [get_ports {data_i[60]}]
set_input_transition -min 2.5  [get_ports {data_i[59]}]
set_input_transition -max 12.5  [get_ports {data_i[59]}]
set_input_transition -min 2.5  [get_ports {data_i[58]}]
set_input_transition -max 12.5  [get_ports {data_i[58]}]
set_input_transition -min 2.5  [get_ports {data_i[57]}]
set_input_transition -max 12.5  [get_ports {data_i[57]}]
set_input_transition -min 2.5  [get_ports {data_i[56]}]
set_input_transition -max 12.5  [get_ports {data_i[56]}]
set_input_transition -min 2.5  [get_ports {data_i[55]}]
set_input_transition -max 12.5  [get_ports {data_i[55]}]
set_input_transition -min 2.5  [get_ports {data_i[54]}]
set_input_transition -max 12.5  [get_ports {data_i[54]}]
set_input_transition -min 2.5  [get_ports {data_i[53]}]
set_input_transition -max 12.5  [get_ports {data_i[53]}]
set_input_transition -min 2.5  [get_ports {data_i[52]}]
set_input_transition -max 12.5  [get_ports {data_i[52]}]
set_input_transition -min 2.5  [get_ports {data_i[51]}]
set_input_transition -max 12.5  [get_ports {data_i[51]}]
set_input_transition -min 2.5  [get_ports {data_i[50]}]
set_input_transition -max 12.5  [get_ports {data_i[50]}]
set_input_transition -min 2.5  [get_ports {data_i[49]}]
set_input_transition -max 12.5  [get_ports {data_i[49]}]
set_input_transition -min 2.5  [get_ports {data_i[48]}]
set_input_transition -max 12.5  [get_ports {data_i[48]}]
set_input_transition -min 2.5  [get_ports {data_i[47]}]
set_input_transition -max 12.5  [get_ports {data_i[47]}]
set_input_transition -min 2.5  [get_ports {data_i[46]}]
set_input_transition -max 12.5  [get_ports {data_i[46]}]
set_input_transition -min 2.5  [get_ports {data_i[45]}]
set_input_transition -max 12.5  [get_ports {data_i[45]}]
set_input_transition -min 2.5  [get_ports {data_i[44]}]
set_input_transition -max 12.5  [get_ports {data_i[44]}]
set_input_transition -min 2.5  [get_ports {data_i[43]}]
set_input_transition -max 12.5  [get_ports {data_i[43]}]
set_input_transition -min 2.5  [get_ports {data_i[42]}]
set_input_transition -max 12.5  [get_ports {data_i[42]}]
set_input_transition -min 2.5  [get_ports {data_i[41]}]
set_input_transition -max 12.5  [get_ports {data_i[41]}]
set_input_transition -min 2.5  [get_ports {data_i[40]}]
set_input_transition -max 12.5  [get_ports {data_i[40]}]
set_input_transition -min 2.5  [get_ports {data_i[39]}]
set_input_transition -max 12.5  [get_ports {data_i[39]}]
set_input_transition -min 2.5  [get_ports {data_i[38]}]
set_input_transition -max 12.5  [get_ports {data_i[38]}]
set_input_transition -min 2.5  [get_ports {data_i[37]}]
set_input_transition -max 12.5  [get_ports {data_i[37]}]
set_input_transition -min 2.5  [get_ports {data_i[36]}]
set_input_transition -max 12.5  [get_ports {data_i[36]}]
set_input_transition -min 2.5  [get_ports {data_i[35]}]
set_input_transition -max 12.5  [get_ports {data_i[35]}]
set_input_transition -min 2.5  [get_ports {data_i[34]}]
set_input_transition -max 12.5  [get_ports {data_i[34]}]
set_input_transition -min 2.5  [get_ports {data_i[33]}]
set_input_transition -max 12.5  [get_ports {data_i[33]}]
set_input_transition -min 2.5  [get_ports {data_i[32]}]
set_input_transition -max 12.5  [get_ports {data_i[32]}]
set_input_transition -min 2.5  [get_ports {data_i[31]}]
set_input_transition -max 12.5  [get_ports {data_i[31]}]
set_input_transition -min 2.5  [get_ports {data_i[30]}]
set_input_transition -max 12.5  [get_ports {data_i[30]}]
set_input_transition -min 2.5  [get_ports {data_i[29]}]
set_input_transition -max 12.5  [get_ports {data_i[29]}]
set_input_transition -min 2.5  [get_ports {data_i[28]}]
set_input_transition -max 12.5  [get_ports {data_i[28]}]
set_input_transition -min 2.5  [get_ports {data_i[27]}]
set_input_transition -max 12.5  [get_ports {data_i[27]}]
set_input_transition -min 2.5  [get_ports {data_i[26]}]
set_input_transition -max 12.5  [get_ports {data_i[26]}]
set_input_transition -min 2.5  [get_ports {data_i[25]}]
set_input_transition -max 12.5  [get_ports {data_i[25]}]
set_input_transition -min 2.5  [get_ports {data_i[24]}]
set_input_transition -max 12.5  [get_ports {data_i[24]}]
set_input_transition -min 2.5  [get_ports {data_i[23]}]
set_input_transition -max 12.5  [get_ports {data_i[23]}]
set_input_transition -min 2.5  [get_ports {data_i[22]}]
set_input_transition -max 12.5  [get_ports {data_i[22]}]
set_input_transition -min 2.5  [get_ports {data_i[21]}]
set_input_transition -max 12.5  [get_ports {data_i[21]}]
set_input_transition -min 2.5  [get_ports {data_i[20]}]
set_input_transition -max 12.5  [get_ports {data_i[20]}]
set_input_transition -min 2.5  [get_ports {data_i[19]}]
set_input_transition -max 12.5  [get_ports {data_i[19]}]
set_input_transition -min 2.5  [get_ports {data_i[18]}]
set_input_transition -max 12.5  [get_ports {data_i[18]}]
set_input_transition -min 2.5  [get_ports {data_i[17]}]
set_input_transition -max 12.5  [get_ports {data_i[17]}]
set_input_transition -min 2.5  [get_ports {data_i[16]}]
set_input_transition -max 12.5  [get_ports {data_i[16]}]
set_input_transition -min 2.5  [get_ports {data_i[15]}]
set_input_transition -max 12.5  [get_ports {data_i[15]}]
set_input_transition -min 2.5  [get_ports {data_i[14]}]
set_input_transition -max 12.5  [get_ports {data_i[14]}]
set_input_transition -min 2.5  [get_ports {data_i[13]}]
set_input_transition -max 12.5  [get_ports {data_i[13]}]
set_input_transition -min 2.5  [get_ports {data_i[12]}]
set_input_transition -max 12.5  [get_ports {data_i[12]}]
set_input_transition -min 2.5  [get_ports {data_i[11]}]
set_input_transition -max 12.5  [get_ports {data_i[11]}]
set_input_transition -min 2.5  [get_ports {data_i[10]}]
set_input_transition -max 12.5  [get_ports {data_i[10]}]
set_input_transition -min 2.5  [get_ports {data_i[9]}]
set_input_transition -max 12.5  [get_ports {data_i[9]}]
set_input_transition -min 2.5  [get_ports {data_i[8]}]
set_input_transition -max 12.5  [get_ports {data_i[8]}]
set_input_transition -min 2.5  [get_ports {data_i[7]}]
set_input_transition -max 12.5  [get_ports {data_i[7]}]
set_input_transition -min 2.5  [get_ports {data_i[6]}]
set_input_transition -max 12.5  [get_ports {data_i[6]}]
set_input_transition -min 2.5  [get_ports {data_i[5]}]
set_input_transition -max 12.5  [get_ports {data_i[5]}]
set_input_transition -min 2.5  [get_ports {data_i[4]}]
set_input_transition -max 12.5  [get_ports {data_i[4]}]
set_input_transition -min 2.5  [get_ports {data_i[3]}]
set_input_transition -max 12.5  [get_ports {data_i[3]}]
set_input_transition -min 2.5  [get_ports {data_i[2]}]
set_input_transition -max 12.5  [get_ports {data_i[2]}]
set_input_transition -min 2.5  [get_ports {data_i[1]}]
set_input_transition -max 12.5  [get_ports {data_i[1]}]
set_input_transition -min 2.5  [get_ports {data_i[0]}]
set_input_transition -max 12.5  [get_ports {data_i[0]}]
set_input_transition -min 2.5  [get_ports {key_i[63]}]
set_input_transition -max 12.5  [get_ports {key_i[63]}]
set_input_transition -min 2.5  [get_ports {key_i[62]}]
set_input_transition -max 12.5  [get_ports {key_i[62]}]
set_input_transition -min 2.5  [get_ports {key_i[61]}]
set_input_transition -max 12.5  [get_ports {key_i[61]}]
set_input_transition -min 2.5  [get_ports {key_i[60]}]
set_input_transition -max 12.5  [get_ports {key_i[60]}]
set_input_transition -min 2.5  [get_ports {key_i[59]}]
set_input_transition -max 12.5  [get_ports {key_i[59]}]
set_input_transition -min 2.5  [get_ports {key_i[58]}]
set_input_transition -max 12.5  [get_ports {key_i[58]}]
set_input_transition -min 2.5  [get_ports {key_i[57]}]
set_input_transition -max 12.5  [get_ports {key_i[57]}]
set_input_transition -min 2.5  [get_ports {key_i[56]}]
set_input_transition -max 12.5  [get_ports {key_i[56]}]
set_input_transition -min 2.5  [get_ports {key_i[55]}]
set_input_transition -max 12.5  [get_ports {key_i[55]}]
set_input_transition -min 2.5  [get_ports {key_i[54]}]
set_input_transition -max 12.5  [get_ports {key_i[54]}]
set_input_transition -min 2.5  [get_ports {key_i[53]}]
set_input_transition -max 12.5  [get_ports {key_i[53]}]
set_input_transition -min 2.5  [get_ports {key_i[52]}]
set_input_transition -max 12.5  [get_ports {key_i[52]}]
set_input_transition -min 2.5  [get_ports {key_i[51]}]
set_input_transition -max 12.5  [get_ports {key_i[51]}]
set_input_transition -min 2.5  [get_ports {key_i[50]}]
set_input_transition -max 12.5  [get_ports {key_i[50]}]
set_input_transition -min 2.5  [get_ports {key_i[49]}]
set_input_transition -max 12.5  [get_ports {key_i[49]}]
set_input_transition -min 2.5  [get_ports {key_i[48]}]
set_input_transition -max 12.5  [get_ports {key_i[48]}]
set_input_transition -min 2.5  [get_ports {key_i[47]}]
set_input_transition -max 12.5  [get_ports {key_i[47]}]
set_input_transition -min 2.5  [get_ports {key_i[46]}]
set_input_transition -max 12.5  [get_ports {key_i[46]}]
set_input_transition -min 2.5  [get_ports {key_i[45]}]
set_input_transition -max 12.5  [get_ports {key_i[45]}]
set_input_transition -min 2.5  [get_ports {key_i[44]}]
set_input_transition -max 12.5  [get_ports {key_i[44]}]
set_input_transition -min 2.5  [get_ports {key_i[43]}]
set_input_transition -max 12.5  [get_ports {key_i[43]}]
set_input_transition -min 2.5  [get_ports {key_i[42]}]
set_input_transition -max 12.5  [get_ports {key_i[42]}]
set_input_transition -min 2.5  [get_ports {key_i[41]}]
set_input_transition -max 12.5  [get_ports {key_i[41]}]
set_input_transition -min 2.5  [get_ports {key_i[40]}]
set_input_transition -max 12.5  [get_ports {key_i[40]}]
set_input_transition -min 2.5  [get_ports {key_i[39]}]
set_input_transition -max 12.5  [get_ports {key_i[39]}]
set_input_transition -min 2.5  [get_ports {key_i[38]}]
set_input_transition -max 12.5  [get_ports {key_i[38]}]
set_input_transition -min 2.5  [get_ports {key_i[37]}]
set_input_transition -max 12.5  [get_ports {key_i[37]}]
set_input_transition -min 2.5  [get_ports {key_i[36]}]
set_input_transition -max 12.5  [get_ports {key_i[36]}]
set_input_transition -min 2.5  [get_ports {key_i[35]}]
set_input_transition -max 12.5  [get_ports {key_i[35]}]
set_input_transition -min 2.5  [get_ports {key_i[34]}]
set_input_transition -max 12.5  [get_ports {key_i[34]}]
set_input_transition -min 2.5  [get_ports {key_i[33]}]
set_input_transition -max 12.5  [get_ports {key_i[33]}]
set_input_transition -min 2.5  [get_ports {key_i[32]}]
set_input_transition -max 12.5  [get_ports {key_i[32]}]
set_input_transition -min 2.5  [get_ports {key_i[31]}]
set_input_transition -max 12.5  [get_ports {key_i[31]}]
set_input_transition -min 2.5  [get_ports {key_i[30]}]
set_input_transition -max 12.5  [get_ports {key_i[30]}]
set_input_transition -min 2.5  [get_ports {key_i[29]}]
set_input_transition -max 12.5  [get_ports {key_i[29]}]
set_input_transition -min 2.5  [get_ports {key_i[28]}]
set_input_transition -max 12.5  [get_ports {key_i[28]}]
set_input_transition -min 2.5  [get_ports {key_i[27]}]
set_input_transition -max 12.5  [get_ports {key_i[27]}]
set_input_transition -min 2.5  [get_ports {key_i[26]}]
set_input_transition -max 12.5  [get_ports {key_i[26]}]
set_input_transition -min 2.5  [get_ports {key_i[25]}]
set_input_transition -max 12.5  [get_ports {key_i[25]}]
set_input_transition -min 2.5  [get_ports {key_i[24]}]
set_input_transition -max 12.5  [get_ports {key_i[24]}]
set_input_transition -min 2.5  [get_ports {key_i[23]}]
set_input_transition -max 12.5  [get_ports {key_i[23]}]
set_input_transition -min 2.5  [get_ports {key_i[22]}]
set_input_transition -max 12.5  [get_ports {key_i[22]}]
set_input_transition -min 2.5  [get_ports {key_i[21]}]
set_input_transition -max 12.5  [get_ports {key_i[21]}]
set_input_transition -min 2.5  [get_ports {key_i[20]}]
set_input_transition -max 12.5  [get_ports {key_i[20]}]
set_input_transition -min 2.5  [get_ports {key_i[19]}]
set_input_transition -max 12.5  [get_ports {key_i[19]}]
set_input_transition -min 2.5  [get_ports {key_i[18]}]
set_input_transition -max 12.5  [get_ports {key_i[18]}]
set_input_transition -min 2.5  [get_ports {key_i[17]}]
set_input_transition -max 12.5  [get_ports {key_i[17]}]
set_input_transition -min 2.5  [get_ports {key_i[16]}]
set_input_transition -max 12.5  [get_ports {key_i[16]}]
set_input_transition -min 2.5  [get_ports {key_i[15]}]
set_input_transition -max 12.5  [get_ports {key_i[15]}]
set_input_transition -min 2.5  [get_ports {key_i[14]}]
set_input_transition -max 12.5  [get_ports {key_i[14]}]
set_input_transition -min 2.5  [get_ports {key_i[13]}]
set_input_transition -max 12.5  [get_ports {key_i[13]}]
set_input_transition -min 2.5  [get_ports {key_i[12]}]
set_input_transition -max 12.5  [get_ports {key_i[12]}]
set_input_transition -min 2.5  [get_ports {key_i[11]}]
set_input_transition -max 12.5  [get_ports {key_i[11]}]
set_input_transition -min 2.5  [get_ports {key_i[10]}]
set_input_transition -max 12.5  [get_ports {key_i[10]}]
set_input_transition -min 2.5  [get_ports {key_i[9]}]
set_input_transition -max 12.5  [get_ports {key_i[9]}]
set_input_transition -min 2.5  [get_ports {key_i[8]}]
set_input_transition -max 12.5  [get_ports {key_i[8]}]
set_input_transition -min 2.5  [get_ports {key_i[7]}]
set_input_transition -max 12.5  [get_ports {key_i[7]}]
set_input_transition -min 2.5  [get_ports {key_i[6]}]
set_input_transition -max 12.5  [get_ports {key_i[6]}]
set_input_transition -min 2.5  [get_ports {key_i[5]}]
set_input_transition -max 12.5  [get_ports {key_i[5]}]
set_input_transition -min 2.5  [get_ports {key_i[4]}]
set_input_transition -max 12.5  [get_ports {key_i[4]}]
set_input_transition -min 2.5  [get_ports {key_i[3]}]
set_input_transition -max 12.5  [get_ports {key_i[3]}]
set_input_transition -min 2.5  [get_ports {key_i[2]}]
set_input_transition -max 12.5  [get_ports {key_i[2]}]
set_input_transition -min 2.5  [get_ports {key_i[1]}]
set_input_transition -max 12.5  [get_ports {key_i[1]}]
set_input_transition -min 2.5  [get_ports {key_i[0]}]
set_input_transition -max 12.5  [get_ports {key_i[0]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[41]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[41]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[34]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[34]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[27]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[27]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[1]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[1]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[11]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[11]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[51]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[51]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[44]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[44]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[37]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[37]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[7]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[7]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[58]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[58]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[21]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[21]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[14]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[14]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[42]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[42]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[35]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[35]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[28]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[28]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[2]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[2]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[12]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[12]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[52]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[52]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[45]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[45]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[38]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[38]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[8]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[8]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[59]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[59]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[22]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[22]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[15]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[15]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[50]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[50]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[43]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[43]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[36]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[36]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[29]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[29]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[3]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[3]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[20]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[20]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[13]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[13]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[60]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[60]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[53]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[53]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[46]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[46]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[39]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[39]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[9]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[9]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[30]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[30]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[23]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[23]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[16]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[16]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[0]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[0]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[51]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[51]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[44]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[44]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[37]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[37]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[4]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[4]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[21]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[21]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[14]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[14]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[61]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[61]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[54]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[54]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[47]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[47]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[31]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[31]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[24]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[24]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[17]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[17]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[1]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[1]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[52]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[52]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[45]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[45]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[38]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[38]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[5]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[5]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[22]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[22]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[15]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[15]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {decrypt_i}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {decrypt_i}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[62]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[62]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[55]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[55]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[48]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[48]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[32]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[32]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[25]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[25]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[18]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[18]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[2]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[2]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[60]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[60]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[53]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[53]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[46]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[46]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[39]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[39]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[6]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[6]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[30]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[30]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[23]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[23]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[16]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[16]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[63]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[63]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[56]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[56]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[49]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[49]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[40]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[40]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[33]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[33]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[26]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[26]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[19]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[19]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[3]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[3]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[61]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[61]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[54]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[54]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[47]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[47]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[10]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[10]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[7]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[7]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[31]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[31]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[24]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[24]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[17]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[17]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[57]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[57]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[41]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[41]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[34]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[34]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[27]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[27]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[4]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[4]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {load_i}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {load_i}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[62]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[62]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[55]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[55]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[48]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[48]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[11]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[11]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[8]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[8]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[32]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[32]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[25]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[25]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[18]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[18]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {reset}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[58]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[58]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[42]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[42]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[35]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[35]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[28]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[28]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[5]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[5]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[63]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[63]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[56]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[56]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[49]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[49]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[12]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[12]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[9]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[9]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[40]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[40]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[33]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[33]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[26]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[26]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[19]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[19]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[0]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[0]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[10]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[10]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[59]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[59]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[50]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[50]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[43]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[43]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[36]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[36]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[29]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[29]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[6]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[6]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_i[57]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_i[57]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[20]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[20]}]
set_input_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {key_i[13]}]
set_input_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {key_i[13]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[58]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[58]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[42]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[42]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[35]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[35]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[28]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[28]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[1]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[1]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[12]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[12]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {ready_o}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {ready_o}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[61]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[61]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[54]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[54]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[47]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[47]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[6]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[6]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[31]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[31]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[24]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[24]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[17]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[17]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[59]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[59]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[50]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[50]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[43]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[43]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[36]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[36]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[29]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[29]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[2]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[2]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[20]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[20]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[13]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[13]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[62]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[62]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[55]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[55]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[48]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[48]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[7]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[7]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[32]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[32]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[25]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[25]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[18]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[18]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[51]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[51]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[44]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[44]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[37]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[37]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[3]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[3]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[21]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[21]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[14]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[14]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[63]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[63]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[56]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[56]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[49]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[49]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[8]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[8]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[40]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[40]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[33]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[33]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[26]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[26]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[19]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[19]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[10]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[10]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[52]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[52]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[45]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[45]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[38]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[38]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[4]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[4]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[22]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[22]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[15]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[15]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[57]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[57]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[9]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[9]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[41]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[41]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[34]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[34]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[27]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[27]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[0]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[0]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[11]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[11]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[60]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[60]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[53]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[53]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[46]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[46]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[39]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[39]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[5]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[5]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[30]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[30]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[23]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[23]}]
set_output_delay -add_delay 12.5 -min -clock [get_clocks {clk}] [get_ports {data_o[16]}]
set_output_delay -add_delay 25 -max -clock [get_clocks {clk}] [get_ports {data_o[16]}]
set_clock_latency -73.2  [get_pins {{stage1_iter_reg[2]/CLK}}]
