###############################################################
#  Generated by:      Cadence Innovus 21.38-e095_1
#  OS:                Linux x86_64(Host ID rno2-sim-i04-038)
#  Generated on:      Tue Jul 29 16:50:36 2025
#  Design:            ac97_top
###############################################################
current_design ac97_top
create_clock [get_ports {clk_i}]  -name clk -period 80.000000 -waveform {0.000000 40.000000}
set_input_delay 0.0 [get_ports {clk_i}] -clock clk
set_propagated_clock  [get_clocks {clk}]
set_input_transition -min 0.8  [get_ports {clk_i}]
set_input_transition -max 4  [get_ports {clk_i}]
set_input_transition -min 0.8  [get_ports {rst_i}]
set_input_transition -max 4  [get_ports {rst_i}]
set_input_transition -min 0.8  [get_ports {wb_data_i[31]}]
set_input_transition -max 4  [get_ports {wb_data_i[31]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[30]}]
set_input_transition -max 4  [get_ports {wb_data_i[30]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[29]}]
set_input_transition -max 4  [get_ports {wb_data_i[29]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[28]}]
set_input_transition -max 4  [get_ports {wb_data_i[28]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[27]}]
set_input_transition -max 4  [get_ports {wb_data_i[27]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[26]}]
set_input_transition -max 4  [get_ports {wb_data_i[26]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[25]}]
set_input_transition -max 4  [get_ports {wb_data_i[25]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[24]}]
set_input_transition -max 4  [get_ports {wb_data_i[24]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[23]}]
set_input_transition -max 4  [get_ports {wb_data_i[23]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[22]}]
set_input_transition -max 4  [get_ports {wb_data_i[22]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[21]}]
set_input_transition -max 4  [get_ports {wb_data_i[21]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[20]}]
set_input_transition -max 4  [get_ports {wb_data_i[20]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[19]}]
set_input_transition -max 4  [get_ports {wb_data_i[19]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[18]}]
set_input_transition -max 4  [get_ports {wb_data_i[18]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[17]}]
set_input_transition -max 4  [get_ports {wb_data_i[17]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[16]}]
set_input_transition -max 4  [get_ports {wb_data_i[16]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[15]}]
set_input_transition -max 4  [get_ports {wb_data_i[15]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[14]}]
set_input_transition -max 4  [get_ports {wb_data_i[14]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[13]}]
set_input_transition -max 4  [get_ports {wb_data_i[13]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[12]}]
set_input_transition -max 4  [get_ports {wb_data_i[12]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[11]}]
set_input_transition -max 4  [get_ports {wb_data_i[11]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[10]}]
set_input_transition -max 4  [get_ports {wb_data_i[10]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[9]}]
set_input_transition -max 4  [get_ports {wb_data_i[9]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[8]}]
set_input_transition -max 4  [get_ports {wb_data_i[8]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[7]}]
set_input_transition -max 4  [get_ports {wb_data_i[7]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[6]}]
set_input_transition -max 4  [get_ports {wb_data_i[6]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[5]}]
set_input_transition -max 4  [get_ports {wb_data_i[5]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[4]}]
set_input_transition -max 4  [get_ports {wb_data_i[4]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[3]}]
set_input_transition -max 4  [get_ports {wb_data_i[3]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[2]}]
set_input_transition -max 4  [get_ports {wb_data_i[2]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[1]}]
set_input_transition -max 4  [get_ports {wb_data_i[1]}]
set_input_transition -min 0.8  [get_ports {wb_data_i[0]}]
set_input_transition -max 4  [get_ports {wb_data_i[0]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[31]}]
set_input_transition -max 4  [get_ports {wb_addr_i[31]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[30]}]
set_input_transition -max 4  [get_ports {wb_addr_i[30]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[29]}]
set_input_transition -max 4  [get_ports {wb_addr_i[29]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[28]}]
set_input_transition -max 4  [get_ports {wb_addr_i[28]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[27]}]
set_input_transition -max 4  [get_ports {wb_addr_i[27]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[26]}]
set_input_transition -max 4  [get_ports {wb_addr_i[26]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[25]}]
set_input_transition -max 4  [get_ports {wb_addr_i[25]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[24]}]
set_input_transition -max 4  [get_ports {wb_addr_i[24]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[23]}]
set_input_transition -max 4  [get_ports {wb_addr_i[23]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[22]}]
set_input_transition -max 4  [get_ports {wb_addr_i[22]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[21]}]
set_input_transition -max 4  [get_ports {wb_addr_i[21]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[20]}]
set_input_transition -max 4  [get_ports {wb_addr_i[20]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[19]}]
set_input_transition -max 4  [get_ports {wb_addr_i[19]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[18]}]
set_input_transition -max 4  [get_ports {wb_addr_i[18]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[17]}]
set_input_transition -max 4  [get_ports {wb_addr_i[17]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[16]}]
set_input_transition -max 4  [get_ports {wb_addr_i[16]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[15]}]
set_input_transition -max 4  [get_ports {wb_addr_i[15]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[14]}]
set_input_transition -max 4  [get_ports {wb_addr_i[14]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[13]}]
set_input_transition -max 4  [get_ports {wb_addr_i[13]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[12]}]
set_input_transition -max 4  [get_ports {wb_addr_i[12]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[11]}]
set_input_transition -max 4  [get_ports {wb_addr_i[11]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[10]}]
set_input_transition -max 4  [get_ports {wb_addr_i[10]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[9]}]
set_input_transition -max 4  [get_ports {wb_addr_i[9]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[8]}]
set_input_transition -max 4  [get_ports {wb_addr_i[8]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[7]}]
set_input_transition -max 4  [get_ports {wb_addr_i[7]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[6]}]
set_input_transition -max 4  [get_ports {wb_addr_i[6]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[5]}]
set_input_transition -max 4  [get_ports {wb_addr_i[5]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[4]}]
set_input_transition -max 4  [get_ports {wb_addr_i[4]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[3]}]
set_input_transition -max 4  [get_ports {wb_addr_i[3]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[2]}]
set_input_transition -max 4  [get_ports {wb_addr_i[2]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[1]}]
set_input_transition -max 4  [get_ports {wb_addr_i[1]}]
set_input_transition -min 0.8  [get_ports {wb_addr_i[0]}]
set_input_transition -max 4  [get_ports {wb_addr_i[0]}]
set_input_transition -min 0.8  [get_ports {wb_sel_i[3]}]
set_input_transition -max 4  [get_ports {wb_sel_i[3]}]
set_input_transition -min 0.8  [get_ports {wb_sel_i[2]}]
set_input_transition -max 4  [get_ports {wb_sel_i[2]}]
set_input_transition -min 0.8  [get_ports {wb_sel_i[1]}]
set_input_transition -max 4  [get_ports {wb_sel_i[1]}]
set_input_transition -min 0.8  [get_ports {wb_sel_i[0]}]
set_input_transition -max 4  [get_ports {wb_sel_i[0]}]
set_input_transition -min 0.8  [get_ports {wb_we_i}]
set_input_transition -max 4  [get_ports {wb_we_i}]
set_input_transition -min 0.8  [get_ports {wb_cyc_i}]
set_input_transition -max 4  [get_ports {wb_cyc_i}]
set_input_transition -min 0.8  [get_ports {wb_stb_i}]
set_input_transition -max 4  [get_ports {wb_stb_i}]
set_input_transition -min 0.8  [get_ports {dma_ack_i[8]}]
set_input_transition -max 4  [get_ports {dma_ack_i[8]}]
set_input_transition -min 0.8  [get_ports {dma_ack_i[7]}]
set_input_transition -max 4  [get_ports {dma_ack_i[7]}]
set_input_transition -min 0.8  [get_ports {dma_ack_i[6]}]
set_input_transition -max 4  [get_ports {dma_ack_i[6]}]
set_input_transition -min 0.8  [get_ports {dma_ack_i[5]}]
set_input_transition -max 4  [get_ports {dma_ack_i[5]}]
set_input_transition -min 0.8  [get_ports {dma_ack_i[4]}]
set_input_transition -max 4  [get_ports {dma_ack_i[4]}]
set_input_transition -min 0.8  [get_ports {dma_ack_i[3]}]
set_input_transition -max 4  [get_ports {dma_ack_i[3]}]
set_input_transition -min 0.8  [get_ports {dma_ack_i[2]}]
set_input_transition -max 4  [get_ports {dma_ack_i[2]}]
set_input_transition -min 0.8  [get_ports {dma_ack_i[1]}]
set_input_transition -max 4  [get_ports {dma_ack_i[1]}]
set_input_transition -min 0.8  [get_ports {dma_ack_i[0]}]
set_input_transition -max 4  [get_ports {dma_ack_i[0]}]
set_input_transition -min 0.8  [get_ports {bit_clk_pad_i}]
set_input_transition -max 4  [get_ports {bit_clk_pad_i}]
set_input_transition -min 0.8  [get_ports {sdata_pad_i}]
set_input_transition -max 4  [get_ports {sdata_pad_i}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[0]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[0]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[20]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[20]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[13]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[13]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[4]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[4]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {sdata_pad_i}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {sdata_pad_i}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[27]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[27]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_ack_i[3]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_ack_i[3]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[11]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[11]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {bit_clk_pad_i}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {bit_clk_pad_i}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[1]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[1]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[21]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[21]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[14]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[14]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[5]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[5]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_stb_i}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_stb_i}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[28]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[28]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_ack_i[4]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_ack_i[4]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_sel_i[0]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_sel_i[0]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[12]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[12]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[2]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[2]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[22]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[22]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[15]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[15]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[6]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[6]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[29]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[29]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_ack_i[5]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_ack_i[5]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_sel_i[1]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_sel_i[1]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[20]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[20]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[13]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[13]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[7]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[7]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[3]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[3]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[30]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[30]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[23]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[23]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[16]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[16]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_ack_i[6]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_ack_i[6]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_sel_i[2]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_sel_i[2]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[21]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[21]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[14]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[14]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[4]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[4]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[31]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[31]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[24]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[24]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[17]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[17]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[8]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[8]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_we_i}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_we_i}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_sel_i[3]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_sel_i[3]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_ack_i[7]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_ack_i[7]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_cyc_i}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_cyc_i}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[22]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[22]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[15]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[15]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[5]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[5]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[25]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[25]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[18]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[18]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[9]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[9]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[0]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[0]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_ack_i[8]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_ack_i[8]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[30]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[30]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[23]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[23]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[16]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[16]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[6]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[6]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[26]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[26]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[19]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[19]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[10]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[10]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[1]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[1]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {rst_i}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {rst_i}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[31]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[31]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[24]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[24]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[17]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[17]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_ack_i[0]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_ack_i[0]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[7]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[7]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[27]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[27]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[11]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[11]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[2]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[2]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[25]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[25]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[18]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[18]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_ack_i[1]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_ack_i[1]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[8]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[8]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[28]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[28]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[12]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[12]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[3]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[3]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[26]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[26]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[19]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[19]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_ack_i[2]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_ack_i[2]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[9]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[9]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_i[29]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_i[29]}]
set_input_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_addr_i[10]}]
set_input_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_addr_i[10]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[21]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[21]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[14]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[14]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[3]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[3]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_req_o[5]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_req_o[5]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[8]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[8]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[26]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[26]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[19]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[19]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[10]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[10]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_req_o[1]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_req_o[1]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {suspended_o}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {suspended_o}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[4]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[4]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_req_o[6]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_req_o[6]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[22]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[22]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[15]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[15]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {int_o}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {int_o}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {sync_pad_o}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {sync_pad_o}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[27]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[27]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[9]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[9]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[11]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[11]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[0]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[0]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_req_o[2]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_req_o[2]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {sdata_pad_o}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {sdata_pad_o}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_req_o[7]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_req_o[7]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[30]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[30]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[23]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[23]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[16]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[16]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[5]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[5]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[28]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[28]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[12]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[12]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[1]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[1]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_req_o[3]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_req_o[3]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {ac97_reset_pad_o_}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {ac97_reset_pad_o_}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_err_o}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_err_o}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[6]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[6]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_req_o[8]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_req_o[8]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[31]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[31]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[24]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[24]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[17]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[17]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_ack_o}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_ack_o}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[29]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[29]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[20]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[20]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[13]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[13]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[2]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[2]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_req_o[4]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_req_o[4]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[25]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[25]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[18]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[18]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {wb_data_o[7]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {wb_data_o[7]}]
set_output_delay -add_delay 4 -min -clock [get_clocks {clk}] [get_ports {dma_req_o[0]}]
set_output_delay -add_delay 8 -max -clock [get_clocks {clk}] [get_ports {dma_req_o[0]}]
set_clock_latency -11.8  [get_pins {{u8_rp_reg[1]/CLK}}]
set_clock_latency -30.9  [get_pins {u14_u3_en_out_l_reg/CLK}]
set_clock_latency -16.4  [get_pins {{u13_occ1_r_reg[3]/CLK}}]
set_clock_latency -12.2  [get_pins {{u6_rp_reg[2]/CLK}}]
set_clock_latency -10.3  [get_pins {{u5_rp_reg[1]/CLK}}]
set_clock_latency -31.6  [get_pins {u14_u3_en_out_l2_reg/CLK}]
set_clock_latency -11.5  [get_pins {{u13_icc_r_reg[18]/CLK}}]
set_clock_latency -14.7  [get_pins {{u13_occ1_r_reg[11]/CLK}}]
set_clock_latency -10  [get_pins {{u13_icc_r_reg[10]/CLK}}]
set_clock_latency -42.8  [get_pins {u14_u5_en_out_l2_reg/CLK}]
set_clock_latency -12.1  [get_pins {{u7_rp_reg[1]/CLK}}]
set_clock_latency -31  [get_pins {u14_u5_en_out_l_reg/CLK}]
set_clock_latency -30.2  [get_pins {u14_u8_en_out_l2_reg/CLK}]
set_clock_latency -12.4  [get_pins {{u13_occ0_r_reg[16]/CLK}}]
set_clock_latency -11.4  [get_pins {{u13_icc_r_reg[2]/CLK}}]
set_clock_latency -10.6  [get_pins {{u5_rp_reg[2]/CLK}}]
set_clock_latency -40.7  [get_pins {{in_valid_s_reg[0]/CLK}}]
set_clock_latency -14.7  [get_pins {{u13_occ0_r_reg[19]/CLK}}]
set_clock_latency -10.3  [get_pins {{u13_icc_r_reg[11]/CLK}}]
set_clock_latency -14.4  [get_pins {{u13_occ0_r_reg[11]/CLK}}]
set_clock_latency -25  [get_pins {u14_u1_en_out_l_reg/CLK}]
set_clock_latency -13.4  [get_pins {{u7_rp_reg[2]/CLK}}]
set_clock_latency -10.4  [get_pins {{u6_rp_reg[1]/CLK}}]
set_clock_latency -13.1  [get_pins {{u13_icc_r_reg[3]/CLK}}]
set_clock_latency -14.5  [get_pins {{u13_occ0_r_reg[3]/CLK}}]
set_clock_latency -12.1  [get_pins {{u4_rp_reg[2]/CLK}}]
set_clock_latency -14.8  [get_pins {{u13_occ1_r_reg[0]/CLK}}]
set_clock_latency -16.5  [get_pins {{u13_occ0_r_reg[27]/CLK}}]
set_clock_latency -14.9  [get_pins {{u9_wp_reg[0]/CLK}}]
set_clock_latency -26.2  [get_pins {u14_u0_en_out_l_reg/CLK}]
set_clock_latency -41.7  [get_pins {valid_s_reg/CLK}]
